package Lesson_1;// One-line comment
/*

 */
// src- sourc code, исходный код содержит ваш рабочийт код
// рабочий код всегда хранится в документе с расширением .java
// Lesson_1.Main.java - любой документ с таким расширением автоматически является исходныи/ рабочим  кодом

// .class - это рабочий код, который был переведен на юайт- код т.е. его откомпелирован
// рабочий код, получил приказ отработать и создать выполненный код на машине
// он превратил ваш обычный код в байт-код, создал документ типа - Lesson_1.Main.class
// компьютер будет вводить результат работы документа .clas

// стандарты разработки и оформления кода
// Джава - любой код пишется внутри структуры класс
// следовательно любой код является частью обьекта
// JAVA - Язык программирования в первую очередь ориентирвван на ООП

// есть несколько парадигм программирования - функциональное , ООП , мультипрограммирование


// Класс - это реализация обьекта
// для создания класса используется ключевое слово class
// ключевое слово - жто специально зарезервированное слова которые ваш компилятор воспринимает как часть языка программирования
// поэтому эти словап не могут использоваться как переменные или каукие-то другие названия

// ооп - обьектно- ориентированное прогрммирование
// стандарт написание классов , методов и имени переменных
// Если обьект - он должен быть сущ.  - House, Person, Game
// Каждый обьект/ класс всегда пишеться с юольшой буквы , потом заканчивается словов и следующее пишеться опять с большой буквы

// Внутри Обьекта любые глаголы -это обьекты
// в нектороых языках действия могу быть вне обьекта
// в таких языка программирования МЕТОДЫ называются Функциями


class Main{
    // Есть группа языков типа-С: C, C++, Java, C#, JS
    // ТОЧКА ВХОДА - entry point
    // ТОЧКА ВХОДА - ЭТО УКАЗАНИЕ ВАШЕЙ ПРОГРАММЕ ОТКУДА НАДО НАЧАТЬ ЧИТАТЬ КОД
    public static void main(String[] args){
        // Стандартная библиотека входа и выхода
        // Standart I/0
        System.out.println("Welcom to Java ");

        System.out.println();// Если ты что-то передал + Плюс автоматом ПЕРЕХОДА НА НОВУЮ СТРОКУ
        // ln- LINE NEW 
        System.out.print("");


    }
}